Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
/*
 * Sd.c
 *
 *  Created on: Dec 26, 2024
 *      Author: cbromann
 */

#include <string.h>

#include "stm32h7xx_hal.h"

#include "Sd.h"
#include "SpiAbs.h"

#undef COUNTOF
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))

// Bit positions for OCR fields
#define OCR_BUSY_BIT_POS          31  // Card Power-Up Status (Busy)
#define OCR_CCS_BIT_POS           30  // Card Capacity Status (CCS)
#define OCR_UHSII_BIT_POS         29  // UHS-II Card (always 0 in SPI mode)
#define OCR_SWITCH_1_8V_BIT_POS   24  // Switching to 1.8V accepted

// Bit positions for Voltage Range Support
#define OCR_VOLTAGE_3_5_3_6_POS   23  // Voltage range 3.5V - 3.6V
#define OCR_VOLTAGE_3_4_3_5_POS   22  // Voltage range 3.4V - 3.5V
#define OCR_VOLTAGE_3_3_3_4_POS   21  // Voltage range 3.3V - 3.4V
#define OCR_VOLTAGE_3_2_3_3_POS   20  // Voltage range 3.2V - 3.3V
#define OCR_VOLTAGE_3_1_3_2_POS   19  // Voltage range 3.1V - 3.2V
#define OCR_VOLTAGE_3_0_3_1_POS   18  // Voltage range 3.0V - 3.1V
#define OCR_VOLTAGE_2_9_3_0_POS   17  // Voltage range 2.9V - 3.0V
#define OCR_VOLTAGE_2_8_2_9_POS   16  // Voltage range 2.8V - 2.9V
#define OCR_VOLTAGE_2_7_2_8_POS   15  // Voltage range 2.7V - 2.8V

// Bit mask for reserved fields
#define OCR_RESERVED_25_28_MASK   (0x0F << 25)  // Bits 25–28
#define OCR_RESERVED_0_14_MASK    (0x7FFF)      // Bits 0–14

// Check Power-Up Status (Bit 31)
#define IS_CARD_READY(ocr)        (((ocr) >> OCR_BUSY_BIT_POS) & 0x1)

// Check Card Capacity Status (Bit 30)
#define IS_CARD_SDHX(ocr)         (((ocr) >> OCR_CCS_BIT_POS) & 0x1)

// Check UHS-II Card Status (Bit 29)
#define IS_UHSII_CARD(ocr)        (((ocr) >> OCR_UHSII_BIT_POS) & 0x1)

// Check Switching to 1.8V (Bit 24)
#define IS_SWITCH_1_8V(ocr)       (((ocr) >> OCR_SWITCH_1_8V_BIT_POS) & 0x1)

// Check Voltage Range Bits
#define IS_VOLTAGE_3_5_3_6(ocr)   (((ocr) >> OCR_VOLTAGE_3_5_3_6_POS) & 0x1)
#define IS_VOLTAGE_3_4_3_5(ocr)   (((ocr) >> OCR_VOLTAGE_3_4_3_5_POS) & 0x1)
#define IS_VOLTAGE_3_3_3_4(ocr)   (((ocr) >> OCR_VOLTAGE_3_3_3_4_POS) & 0x1)
#define IS_VOLTAGE_3_2_3_3(ocr)   (((ocr) >> OCR_VOLTAGE_3_2_3_3_POS) & 0x1)
#define IS_VOLTAGE_3_1_3_2(ocr)   (((ocr) >> OCR_VOLTAGE_3_1_3_2_POS) & 0x1)
#define IS_VOLTAGE_3_0_3_1(ocr)   (((ocr) >> OCR_VOLTAGE_3_0_3_1_POS) & 0x1)
#define IS_VOLTAGE_2_9_3_0(ocr)   (((ocr) >> OCR_VOLTAGE_2_9_3_0_POS) & 0x1)
#define IS_VOLTAGE_2_8_2_9(ocr)   (((ocr) >> OCR_VOLTAGE_2_8_2_9_POS) & 0x1)
#define IS_VOLTAGE_2_7_2_8(ocr)   (((ocr) >> OCR_VOLTAGE_2_7_2_8_POS) & 0x1)

#define SD_SPI_PRE_CMD_CLOCKS 8U

/*! SD card instances buffer*/

/* Buffer used for transmission */
static uint8_t SPI_CMD_READ_BUFFER[SD_SDHC_SECTOR_SIZE] = {0};

uint8_t aTxSpiCmd[6];

ALIGN_32BYTES(const uint8_t __attribute__((used,section(".dma_buffer.ro"))) aTxSpiInit[18]) = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

static uint8_t SD_Spi_CreateCommand(uint8_t cmd, uint32_t payload, uint8_t * buffer)
{
	uint8_t RetVal;

	switch (cmd) {
	case SD_SPI_CMD0:
		buffer[0] = 0x40;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x95;
		break;
	case SD_SPI_CMD8:
		buffer[0] = 0x48;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x01;
		buffer[4] = 0xAA;
		buffer[5] = 0x87;
		break;
	case SD_SPI_CMD9:
		buffer[0] = 0x49;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD12:
		buffer[0] = 0x4C;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x01;
		break;
    case SD_SPI_CMD13:
		buffer[0] = 0x4D;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD16:
		buffer[0] = 0x50;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD17:
		buffer[0] = 0x51;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
    case SD_SPI_CMD18:
		buffer[0] = 0x52;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD24:
		buffer[0] = 0x58;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
    case SD_SPI_CMD25:
		buffer[0] = 0x59;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
    case SD_SPI_CMD32:
		buffer[0] = 0x40 + 32U;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
    case SD_SPI_CMD33:
		buffer[0] = 0x40 + 32U;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD38:
		buffer[0] = 0x40 + 38U;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD55:
		buffer[0] = 0x77;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x01;
		break;
	case SD_SPI_CMD58:
		buffer[0] = 0x7A;
		buffer[1] = 0x00;
		buffer[2] = 0x00;
		buffer[3] = 0x00;
		buffer[4] = 0x00;
		buffer[5] = 0x01;
		break;
	case SD_SPI_ACMD41:
		buffer[0] = 0x69;
		buffer[1] = (payload >> 24) & 0xFF;
		buffer[2] = (payload >> 16) & 0xFF;
		buffer[3] = (payload >> 8) & 0xFF;
		buffer[4] = payload & 0xFF;
		buffer[5] = 0x01;
		break;
	default:
		buffer[0] = 0xFF;
		buffer[1] = 0xFF;
		buffer[2] = 0xFF;
		buffer[3] = 0xFF;
		buffer[4] = 0xFF;
		buffer[5] = 0xFF;
		RetVal = 1;
	}

	return RetVal;
}

