Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
	return 0;
}

uint8_t SD_Spi_SendOpCond(Spi_R1Response * pResponse)
{
    // assert chip select
//	SpiAbs_CsDisable(SPIABS_DEVICE_1);

	SpiAbs_CsEnable(SPIABS_DEVICE_1);


	SD_Spi_SendCommand(SD_SPI_ACMD41, 0x40000000); // Precede ACMD41 with CMD55
	SpiAbs_CsDisable(SPIABS_DEVICE_1);

	SpiAbs_CsEnable(SPIABS_DEVICE_1);
	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);
    // deassert chip select

	SpiAbs_CsDisable(SPIABS_DEVICE_1);


    return 0;
}

uint8_t SD_Spi_ReadOCR(Spi_R1Response * pResponse)
{
    // assert chip select

	SpiAbs_CsEnable(SPIABS_DEVICE_1);


	SD_Spi_SendCommand(SD_SPI_CMD58, 0x00000000);
	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

    // deassert chip select

	SpiAbs_CsDisable(SPIABS_DEVICE_1);


    return 0;
}

uint8_t SD_Spi_SendCSDRequest(Spi_R1Response * pResponse)
{
	SD_Spi_SendCommandPollResponse(SD_SPI_CMD9, 0x00000000, &pResponse->byte);

	return 0;
}

uint8_t SD_Spi_ReadRes7(uint8_t * pRxBuffer)
{
	SpiAbs_CsEnable(SPIABS_DEVICE_1);
	
    SpiAbs_Receive_Spi1_Task0((uint8_t *)pRxBuffer, 4);
    
    SpiAbs_CsEnable(SPIABS_DEVICE_1);

	return 0;
}

/**
  * @brief  Initializes the card and determines its type (e.g., SDSC, SDHC, SDXC).
			Sets up the card for further operations.
  * @param  None
  * @retval None
  */
uint8_t SD_Spi_Initialize(uint8_t CsLine)
{
	uint8_t RetVal;
	uint8_t counter;
	uint32_t OcrByte;
	Spi_R1Response response;
	OCR_Register OcrResponse;
	uint8_t ocr[4];
	uint8_t buffer[4];

	RetVal = 0x00;

	HAL_Delay(100);
	SD_Spi_PowerUp();
	HAL_Delay(300);
	SD_Spi_GoIdleState(&response);

	if (0x01 == response.byte)
	{
		// SD card successfully initialized
		SD_Spi_WaitTillIdle();
		SD_Spi_SendIfCond(&response);

		if ((response.byte & 0x3F) == 0x01)  // Ignore bit 6 (Erase Reset)
		{
			SD_Spi_ReadRes7(ocr);
			SD_Spi_WaitTillIdle();

			if (ocr[2] == 0x01 && ocr[3] == 0xAA) {
				counter = 0;
				do
				{
					SD_Spi_SendApp(&response);

					if (counter > 100)
					{
						RetVal = 3;
					}

					if (response.byte < 0x02 && 0 == RetVal)
					{

					}
					SD_Spi_SendOpCond(&response);

					HAL_Delay(10);

					counter++;
				} while (response.byte != 0x00 && 0 == RetVal);  // Wait for idle state to clear
				
				// TODO: if OpComd is rejected, retry with CMD1
				{

				}
                
                OcrResponse.cpusb = 0;
				while (0U == RetVal && 0U == OcrResponse.cpusb)
				{
					HAL_Delay(10);

					SD_Spi_WaitTillIdle();

					// Send CMD58 to read OCR and check CCS bit
					SD_Spi_ReadOCR(&response);

					if (response.byte == 0x00) {

						SD_Spi_ReadRes7(buffer);
						OcrByte = (buffer[0] << 24) | (buffer[1] << 16) | (buffer[2] << 8) | buffer[3];
						SD_Spi_Ocr2Bitfield(OcrByte, &OcrResponse);
						if (IS_CARD_READY(OcrByte))
						{
							// card is a ver. 2.0 or later high capacity SD card (SDHC) or extended capacity SD card (SCXC)
						}
						else
						{
							// card is a ver. 2.0 or later standard capacity SD memory card
						}
					}
				}

			}
			else
			{
				RetVal = 2;
			}
		}
	}
	else
	{
		RetVal = 1;
	}

	if (0U == RetVal) 
    {
        RetVal = SpiAbs_GoHighSpeed(SPIABS_DEVICE_1);
    }
	else
    {
        RetVal = RES_ERROR;
    }

    return RetVal;
}

uint8_t SD_Spi_ReadCSD(SdCsdRegisterType * csd)
{
	Spi_R1Response resp;
	uint32_t readAttempts;
	uint8_t Crc = 0;
	uint8_t RetVal = 0;

	SD_Spi_SendCommandPollResponse(SD_SPI_CMD9, 0x00000000, &resp.byte);

	SpiAbs_CsEnable(SPIABS_DEVICE_1);

	if(resp.byte != 0xFF)
	{
		// wait for a response token (timeout = 100ms)
		readAttempts = 0;
		while(++readAttempts < SD_MAX_READ_RESPONSE_ATTEMPTS)
		{
			SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
			if(resp.byte != 0xFF)
			{
				break;
			}
		}

		// if response token is 0xFE
		if(resp.byte == SD_SPI_CMD_START_TOKEN)
		{
			SpiAbs_Receive_Spi1_Task0(SPI_CMD_READ_BUFFER, SD_SPI_CSD_LENGTH);

			// read 16-bit CRC
            SpiAbs_Receive_Spi1_Task0((uint8_t *)&Crc, sizeof(Crc));

			if (0 != Crc)
			{
				RetVal = 0U;
			}
		}
		else
		{
			RetVal = 1U;
		}
	}

	SpiAbs_CsDisable(SPIABS_DEVICE_1);

	if (0U == RetVal)
	{
		SD_Spi_Csd2Bitfield(SPI_CMD_READ_BUFFER, csd);
	}

	return RetVal;
}

/*******************************************************************************
 Read single 512 byte block
 token = 0xFE - Successful read
 token = 0x0X - Data error
 token = 0xFF - Timeout
*******************************************************************************/
uint8_t SD_Spi_readSingleBlock(uint32_t address, Spi_R1Response * pResponse)
{
	uint8_t RetVal;
	uint32_t readAttempts, tokenPollCount;
	uint8_t *readBuffer;
	uint8_t CardStatus, Dummy[SD_SPI_PRE_CMD_CLOCKS];
    uint16_t Crc = 0;
	Spi_R1Response resp;
	uint8_t GotResponse;
	uint8_t i;
	uint8_t Run = 0U;

	(void) Run;

	RetVal = 0U;
	readBuffer = SPI_CMD_READ_BUFFER;

	memset(readBuffer, 0U, SD_SDHC_SECTOR_SIZE);

	SpiAbs_CsDisable(SPIABS_DEVICE_1);	

    SpiAbs_Receive_Spi1_Task0(&Dummy, sizeof(Dummy));

	SpiAbs_CsEnable(SPIABS_DEVICE_1);

	SD_Spi_SendCommand(SD_SPI_CMD13, 0); // CMD13 to check card status
	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

	switch (pResponse->byte)
	{
	case 0x00: // card is ready
        SpiAbs_Receive_Spi1_Task0(&CardStatus, sizeof(CardStatus));
		break;
	case 0x01: // idle state
        SpiAbs_Receive_Spi1_Task0(&CardStatus, sizeof(CardStatus));
		RetVal = SD_Spi_Initialize(0U);
		break;	
	case 0xFF: // not responding
	default:
		SpiAbs_CsDisable(SPIABS_DEVICE_1);
		// TODO: power on and off (somehow the SD card gets unresponsive after a while)
		RetVal = SD_Spi_Initialize(0U);
		break;
	}

	if (0U != RetVal) return RetVal;

	SpiAbs_CsDisable(SPIABS_DEVICE_1);	

    SpiAbs_Receive_Spi1_Task0(&Dummy, sizeof(Dummy));

	SpiAbs_CsEnable(SPIABS_DEVICE_1);

	readAttempts = 0;
	do
	{
		SD_Spi_SendCommand(SD_SPI_CMD17, address);
		SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

		if(pResponse->byte != 0xFF)
		{
			// wait for a response token (timeout = 100ms)
			tokenPollCount = 0;
			GotResponse = 0U;
			while(++tokenPollCount < SD_MAX_READ_RESPONSE_ATTEMPTS)
			{
				SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);
				if(pResponse->byte != 0xFF)
				{
					GotResponse = 1U;
					break;
				}
			}
		}
		else
		{
			RetVal = 2U;
			break;
		}
	}
	while ((0U == GotResponse) && (3 > readAttempts++));

	if (pResponse->byte == SD_SPI_CMD_START_TOKEN)  // if response token is 0xFE
	{
	}
	else if(pResponse->byte != SD_SPI_CMD_START_TOKEN)  // if response token is 0xFE
	{
		SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

