Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

    if(resp.byte == 0xFF)
	{
        res = SD_E_CMD_NO_R1;
	}

    if (0 == res)
	{
        for (uint32_t j = 0; j < cnt; j++)
        {
            memcpy(&Tmp[0], &StartDataToken, sizeof(StartDataToken));
            memcpy(&Tmp[sizeof(StartDataToken)], &buff[j * SD_SECTOR_LENGTH], SD_SECTOR_LENGTH);
            memcpy(&Tmp[sizeof(StartDataToken) + SD_SECTOR_LENGTH], &Crc, sizeof(Crc));
            
            SpiAbs_Send_Spi1_Task0(Tmp, sizeof(Tmp));

            SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

            if ((resp.byte & 0x1F) == SD_DEF_DATA_ACCEPTED_TOKEN)
            {

            }
            else if ((resp.byte & 0x1F) == SD_DEF_CRC_ERROR_TOKEN)
            {
                res = SD_E_CMD_NO_DATA_RESP_TOKEN;
            }
            else if ((resp.byte & 0x1F) == SD_DEF_WRITE_ERROR_TOKEN)
            {
                res = SD_E_CMD_NO_DATA_RESP_TOKEN;
            }
            
            if (0 == res)
            {
                readResponseAttempts = 0;
                do 
                { //Waiting for the end of the state BUSY
                    SpiAbs_readByte(SPIABS_DEVICE_1, &resp.byte);
                } while ( (resp.byte != 0xFF) && (++readResponseAttempts<SD_MAX_READ_RESPONSE_ATTEMPTS) );
                
                if (readResponseAttempts>=SD_MAX_READ_RESPONSE_ATTEMPTS)
                {
                    res = SD_E_CMD_NO_GOING_IDLE;
                }
            }

            if (0 != res)
            {
                break;
            }
        }
    }

    if (0 == res)
	{
		SpiAbs_writByte(SPIABS_DEVICE_1, &StopDataToken);
	}

    if (0 == res)
	{
		readResponseAttempts = 0;
		do 
		{ //Waiting for the end of the state BUSY
			SpiAbs_readByte(SPIABS_DEVICE_1, &resp.byte);
		} while ( (resp.byte != 0xFF) && (++readResponseAttempts<SD_MAX_READ_RESPONSE_ATTEMPTS) );
		
		if (readResponseAttempts>=SD_MAX_READ_RESPONSE_ATTEMPTS)
		{
			res = SD_E_CMD_NO_GOING_IDLE;
		}
	}

    if (0 != res)
    {
        Sd_Spi_ErrorHandlerHook();
    }

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    return res;
}

uint8_t SD_Spi_writeBlock(uint32_t address, uint8_t const  *buff)
{
	uint8_t RetVal;
	uint32_t readResponseAttempts;
	uint16_t Crc=0U; 
	Spi_R1Response resp;
	const uint8_t StartDataToken = SD_DEF_START_DATA_MARKER;

	RetVal = 0U;

	SpiAbs_CsEnable(SPIABS_DEVICE_1);

	SD_Spi_SendCommand(SD_SPI_CMD24, address);
	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

	if(resp.byte == 0xFF)
	{
        RetVal = SD_E_CMD_NO_R1;
	}

	if (0 == RetVal)
	{
		// Send 0xFE start token
		SpiAbs_writByte(SPIABS_DEVICE_1, &StartDataToken);

        for(uint32_t i = 0; i < SD_SECTOR_LENGTH; i += SD_SPI_SECTOR_CHUNK_SIZE)
		{
            if (SD_SECTOR_LENGTH - i > SD_SPI_SECTOR_CHUNK_SIZE)
            {
                SpiAbs_Send_Spi1_Task0(&buff[i], SD_SPI_SECTOR_CHUNK_SIZE);
            }
            else
            {
                SpiAbs_Send_Spi1_Task0(&buff[i], SD_SECTOR_LENGTH - i);
            }
		}

        SpiAbs_Send_Spi1_Task0((uint8_t *)&Crc, sizeof(Crc));

		SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
		if (SD_DEF_DATA_RESP_TOKEN != (0x0F & resp.byte))
		{
			RetVal = SD_E_CMD_NO_DATA_RESP_TOKEN;
		}
	}

	if (0 == RetVal)
	{
		readResponseAttempts = 0;
		do 
		{ //Waiting for the end of the state BUSY
			SpiAbs_readByte(SPIABS_DEVICE_1, &resp.byte);
		} while ( (resp.byte != 0xFF) && (++readResponseAttempts<SD_MAX_READ_RESPONSE_ATTEMPTS) );
		
		if (readResponseAttempts>=SD_MAX_READ_RESPONSE_ATTEMPTS)
		{
			RetVal = SD_E_CMD_NO_GOING_IDLE;
		}
	}

	SpiAbs_CsDisable(SPIABS_DEVICE_1);

	return RetVal;
}

uint8_t SD_Spi_GetReadBytes(uint8_t * buff)
{
	memcpy(buff, SPI_CMD_READ_BUFFER, SD_SDHC_SECTOR_SIZE);
	return 0U;
}
